const f = require('../if-14.js');

QUnit.test("ЗАДАЧА 14. f(x1, y1, x2, y2, x3, y3) возварщает четвертую вершину (x4, y4) прямоугольника", function(assert){
	assert.deepEqual(f(5, 2, 2, 5, 6, 9), "9 6", "Не выполнено f(5, 2, 2, 5, 6, 9) === 9 6")
	assert.deepEqual(f(5, 2, 2, 5, 9, 6), "6 9", "Не выполнено f(5, 2, 2, 5, 9, 6) === 6 9")
	assert.deepEqual(f(5, 2, 6, 9, 9, 6), "2 5", "Не выполнено f(5, 2, 6, 9, 9, 6) === 2 5")
	assert.deepEqual(f(2, 5, 6, 9, 9, 6), "5 2", "Не выполнено f(2, 5, 6, 9, 9, 6) === 5 2")
});
