const [X4, Y4] = require('../if-14.js');

QUnit.test("ЗАДАЧА 14. X4, Y4 возварщает четвертую вершину (x4, y4) прямоугольника", function(assert){
	assert.deepEqual(X4(5, 2, 2, 5, 6, 9), 9, "Не выполнено X4(5, 2, 2, 5, 6, 9) === 9")
	assert.deepEqual(X4(5, 2, 2, 5, 9, 6), 6, "Не выполнено X4(5, 2, 2, 5, 9, 6) === 6")
	assert.deepEqual(X4(5, 2, 6, 9, 9, 6), 2, "Не выполнено X4(5, 2, 6, 9, 9, 6) === 2")
	assert.deepEqual(X4(2, 5, 6, 9, 9, 6), 5, "Не выполнено X4(2, 5, 6, 9, 9, 6) === 5")
	assert.deepEqual(Y4(5, 2, 2, 5, 6, 9), 6, "Не выполнено Y4(5, 2, 2, 5, 6, 9) === 6")
	assert.deepEqual(Y4(5, 2, 2, 5, 9, 6), 9, "Не выполнено Y4(5, 2, 2, 5, 9, 6) === 9")
	assert.deepEqual(Y4(5, 2, 6, 9, 9, 6), 5, "Не выполнено Y4(5, 2, 6, 9, 9, 6) === 5")
	assert.deepEqual(Y4(2, 5, 6, 9, 9, 6), 2, "Не выполнено Y4(2, 5, 6, 9, 9, 6) === 2")
});
